performance/tests/orderNumberConfiguration.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-order-number-configuration
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: update-order-number-configuration

scenarios:
  get-order-number-configuration:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orderNumberConfigurations
        method: GET
        label: GetOrderNumberConfiguration
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  update-order-number-configuration:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orderNumberConfigurations
        method: POST
        label: UpdateOrderNumberConfiguration
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        jsr223:
          execute: before
          script-text: |
            import groovy.json.JsonOutput;

            def config = [
              orderNumberPrefix: "ORDER",
              includeOrderNumberPrefix: true,
              includeProgramCode: false,
              includeTypeSuffix: false
            ]

            vars.put("new_config", JsonOutput.toJson(config));
        body: ${new_config}
reporting:
    - module: passfail
      criteria:
        - 'p90>2500ms, continue as failed, label=GetOrderNumberConfiguration, title="p90 response time too high"'
        - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetOrderNumberConfiguration, title="Improvement needed"'
        - 'failures>1%, continue as failed, label=GetOrderNumberConfiguration, title="Failure rate too high"'