performance/tests/proofOfDelivery.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-pods
  - concurrency: 1
    hold-for: 2m
    scenario: get-pods-by-order-id
  - concurrency: 1
    hold-for: 2m
    scenario: get-pod
  - concurrency: 1
    hold-for: 2m
    scenario: get-pod-expand
  - concurrency: 1
    hold-for: 2m
    scenario: get-pod-expand-nested
  - concurrency: 1
    hold-for: 2m
    scenario: print-pod-pdf
  - concurrency: 1
    hold-for: 2m
    scenario: print-pod-csv

scenarios:
  get-pods:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery
        method: GET
        label: GetAllProofsOfDelivery
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pods-by-order-id:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery?orderId=${__P(order_id)}
        method: GET
        label: GetProofsOfDeliveryByOrderId
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}
        method: GET
        label: GetProofOfDelivery
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod-expand:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}?expand=shipment
        method: GET
        label: GetProofOfDeliveryWithExpand
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod-expand-nested:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}?expand=shipment.order
        method: GET
        label: GetProofOfDeliveryWithNestedExpand
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-pdf:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=pdf
        method: GET
        label: PrintProofOfDeliveryAsPdf
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=csv
        method: GET
        label: PrintProofOfDeliveryAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json

reporting:
    - module: passfail
      criteria:
        Get All PODs is too slow: p90 of GetAllProofsOfDelivery>12000ms
        Get POD By Order Id is too slow: p90 of GetProofsOfDeliveryByOrderId>8000ms
        Get POD is too slow: p90 of GetProofOfDelivery>8000ms
        Get POD With Expand is too slow: p90 of GetProofOfDeliveryWithExpand>16000ms
        Get POD With Nested Expand is too slow: p90 of GetProofOfDeliveryWithNestedExpand>26000ms
        Print POD As Pdf is too slow: p90 of PrintProofOfDeliveryAsPdf>4000ms
        Print POD As Csv is too slow: p90 of PrintProofOfDeliveryAsCsv>4000ms