performance/tests/proofOfDelivery.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-pods
  - concurrency: 1
    hold-for: 2m
    scenario: get-pod
  - concurrency: 1
    hold-for: 2m
    scenario: print-pod-pdf
  - concurrency: 1
    hold-for: 2m
    scenario: print-pod-csv

scenarios:
  get-user-token:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(user-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
  get-pods:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery
        method: GET
        label: GetAllProofOfDeliveries
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}
        method: GET
        label: GetProofOfDelivery
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-pdf:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=pdf
        method: GET
        label: PrintProofOfDeliveryAsPdf
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=csv
        method: GET
        label: PrintProofOfDeliveryAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json