performance/tests/proofOfDelivery.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-pods
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-pods-by-order-id
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-pod
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-pod-expand
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-pod-expand-nested
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: print-pod-pdf
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: print-pod-csv

scenarios:
  get-pods:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery
        method: GET
        label: GetAllProofsOfDelivery
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pods-by-order-id:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery?orderId=${__P(order_id)}
        method: GET
        label: GetProofsOfDeliveryByOrderId
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}
        method: GET
        label: GetProofOfDelivery
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod-expand:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}?expand=shipment
        method: GET
        label: GetProofOfDeliveryWithExpand
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-pod-expand-nested:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}?expand=shipment.order
        method: GET
        label: GetProofOfDeliveryWithNestedExpand
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-pdf:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=pdf
        method: GET
        label: PrintProofOfDeliveryAsPdf
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-pod-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/proofsOfDelivery/${__P(pod_id)}/print?format=csv
        method: GET
        label: PrintProofOfDeliveryAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json

reporting:
  - module: passfail
    criteria:
      - 'p90<=1500ms, continue as passed, label=GetAllProofsOfDelivery, title="Get All PODs is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetAllProofsOfDelivery, title="Get All PODs needs improvement"'
      - 'p90>2500ms, continue as failed, label=GetAllProofsOfDelivery, title="Get All PODs is too slow"'

      - 'p90<=1500ms, continue as passed, label=GetProofsOfDeliveryByOrderId, title="Get POD by Order ID is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetProofsOfDeliveryByOrderId, title="Get POD by Order ID needs improvement"'
      - 'p90>2500ms, continue as failed, label=GetProofsOfDeliveryByOrderId, title="Get POD by Order ID is too slow"'

      - 'p90<=1500ms, continue as passed, label=GetProofOfDelivery, title="Get POD is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetProofOfDelivery, title="Get POD needs improvement"'
      - 'p90>2500ms, continue as failed, label=GetProofOfDelivery, title="Get POD is too slow"'

      - 'p90<=1500ms, continue as passed, label=GetProofOfDeliveryWithExpand, title="Get POD with Expand is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetProofOfDeliveryWithExpand, title="Get POD with Expand needs improvement"'
      - 'p90>2500ms, continue as failed, label=GetProofOfDeliveryWithExpand, title="Get POD with Expand is too slow"'

      - 'p90<=1500ms, continue as passed, label=GetProofOfDeliveryWithNestedExpand, title="Get POD with Nested Expand is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetProofOfDeliveryWithNestedExpand, title="Get POD with Nested Expand needs improvement"'
      - 'p90>2500ms, continue as failed, label=GetProofOfDeliveryWithNestedExpand, title="Get POD with Nested Expand is too slow"'

      - 'p90<=1500ms, continue as passed, label=PrintProofOfDeliveryAsPdf, title="Print POD as PDF is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=PrintProofOfDeliveryAsPdf, title="Print POD as PDF needs improvement"'
      - 'p90>2500ms, continue as failed, label=PrintProofOfDeliveryAsPdf, title="Print POD as PDF is too slow"'

      - 'p90<=1500ms, continue as passed, label=PrintProofOfDeliveryAsCsv, title="Print POD as CSV is successful"'
      - 'p90>1500ms and p90<=2500ms, continue as passed, label=PrintProofOfDeliveryAsCsv, title="Print POD as CSV needs improvement"'
      - 'p90>2500ms, continue as failed, label=PrintProofOfDeliveryAsCsv, title="Print POD as CSV is too slow"'